Revit 2024 API
MemberForcesServiceData Methods
The MemberForcesServiceData type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCurrentElements
 Returns the list of Ids of the current elements.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
MemberForcesServiceData Class
Autodesk.Revit.DB.Structure Namespace